<template>
    <div id="presentation">
        <h2>Plan001</h2>
        <section class="paragraph">
            <h3>OverView / 概要</h3>
            <p>
                太陽系の惑星・黄道十二星座についてのサイト<br>
                太陽系の惑星の、大きさ・太陽からの距離・公転速度・自転速度などの情報、黄道十二星座の、位置・距離・星の連なりなど、それぞれの情報をグラフィカルに気持ちよく・心地よく・使いやすく、表現したサイトを目標とする。<br>
                内容や情報よりも、グラフィカルな表現に重きを置いており、記載される情報については調べれば、それほど苦労せずに手に入る情報となるだろうが、それらの情報にどれだけ関心を持ってもらえるか、そして読んでもらえるかが重要だと考えている。<br>
                これは私自身がフロントエンジニアとしてサイト制作にかかわることが多く、またその領域を得意としていることから、こうした目標設定になっている。<br>
                また心地よさ・使いやすさなどを重視することと、モダンな制作方法を両立することを目標としており、Vue.js ,
                Nuxt.jsといったSPA(シングルページアプリケーション)を用いた高速処理、Three.jsを使用した三次元的な表現、インタラクションを組み合わせて制作しようと考えている。
            </p>
        </section>
        <section class="paragraph">
            <h3>Production Method / 制作方法</h3>
            <h4>DESIGN</h4>
            <p>
                タイポグラフィー , 幾何学的 , 3Dを用いた三次元的なグラフィックス , UI / UXを意識したデザインにしようと考えている。端的に言うならば、幻想的で美しいく使いやすいサイトを目標としている。
                ナビゲーションやテキストなどのインターフェース部分は平面的な表現、オブジェクトなどの装飾部分は立体的な表現にすることを考えている。
            </p>
            <h4>CODE / PROGRAM</h4>
            <p>
                Vue.jsの派生フレームワークであるNuxt.jsを使用したSPA(Single Page
                Application)によるページ遷移がなく処理の早い制作方法、Three.jsを使用したWebGLによるグラフィカルな表現、バックエンドに関しては私自身にスキルがないこと、今回の制作物にはなくても比較的困らないことから、考慮しない。
                また、バージョン管理システムのgit , githubを使用しソースコードを管理することによって、制作段階での修正を行うと同時に今後の自分であったり、今後Vue.js , Nuxt.js ,
                Three.jsを学習する人の参考となるように制作過程(commit履歴)を保存する。
            </p>
        </section>
    </div>
</template>

<style lang="scss">
@import url('https://fonts.googleapis.com/css2?family=Kaisei+Decol:wght@400;500;700&display=swap');

#presentation {
    font-family: 'Kaisei Decol', serif;
    margin: 0 0 0 200px;
}
</style>