<template>
    <div class="sign">
        <SignPage :data="data" />
    </div>
</template>

<script setup lang="ts">
const data = {
    title: {
        main: 'LIBRA',
        sub: 'Harmony and Beauty, Libra',
    },
    body: `てんびん座は、黄道十二星座の7番目に位置する星座であり、ラテン語で「Libra（リブラ）」と呼ばれ、天秤を象徴しています。この星座は、古代ローマの文化において法と秩序を表すものとされ、公平さと調和を強調します。
            てんびん座の人々は、公平さや正義感を重視し、対話と協力を大切にします。彼らは社交的で魅力的であり、調和と平和を築く努力を好みます。また、美的なセンスや芸術的な嗜好があることが多く、美しいものやバランスの取れた環境を求めることがあります。
            占星術的には、てんびん座は調和、対人関係、美、協力に焦点を当て、対人スキルや社交性が強調されることがあります。てんびん座は9月23日から10月22日までの期間に太陽が通過する星座であり、この期間に生まれた人々はてんびん座の特徴を強調された個性を持つとされています。`,
};
</script>