<template>
    <div id="sign-page">
        <div class="sign">
            <SignPage :data="data" />
        </div>
        <div id="bg"></div>
    </div>
</template>

<script setup lang="ts">
const data = {
    title: {
        main: 'PISCES',
        sub: 'Sensitivity and Pursuit of Dreams, Pisces',
    },
    body: `うお座は、黄道十二星座の12番目に位置する星座であり、ラテン語で「Pisces（ピスケス）」と呼ばれ、魚を象徴しています。この星座は、古代ギリシャの神話において、水の精霊であるアプロディーテ（ヴィーナス）の変身した2匹の魚と関連付けられています。
            うお座の人々は、感受性が豊かで創造的な個性を持ち、直感力に優れています。彼らは情熱的でロマンチストな一面もあり、他人に対して思いやりと理解を示すことが多いです。また、非常に精神的な傾向があり、スピリチュアルな探求や内面の成長に興味を持つことがあります。
            占星術的には、うお座は夢、直感、共感、癒しに焦点を当て、個人の内面や精神的な成長に向けた旅を強調します。うお座は2月19日から3月20日までの期間に太陽が通過する星座であり、この期間に生まれた人々はうお座の特徴を強調された個性を持つとされています。`,
};
</script>