<template>
    <div id="sign-page">
        <div class="sign">
            <SignPage :data="data" />
        </div>
        <div id="bg"></div>
    </div>
</template>

<script setup lang="ts">
const data = {
    title: {
        main: 'TAURUS',
        sub: 'Symbol of Patience and Stability, Taurus',
    },
    body: `おうし座は、黄道十二星座の2番目に位置する星座であり、ラテン語で「Taurus（タウラス）」と呼ばれ、牛を象徴しています。この星座の由来は、ギリシャ神話に関連しており、美しいプリンセスであるエウロペが、神ゼウスによって牛に変えられて連れ去られた物語に起源を持ちます。
            おうし座の人々は、安定感、忍耐力、頑固さ、実践的な思考などの特徴を持っており、しばしば忍耐強く物事を追求し、豊かな感覚を持っています。また、美的センスに優れたり、芸術や自然とのつながりを大切にする傾向があります。
            占星術では、おうし座は頑固さや忍耐力が強調され、物質的な安定や快適さを追求する星座とされています。また、金銭面や資産の増加に焦点を当てることもあります。
            おうし座は、4月20日から5月20日までの期間に太陽が通過する星座であり、この期間に生まれた人々はおうし座の特徴を強調された個性を持つとされています。`,
};
</script>