<template>
    <div class="sign">
        <SignPage :data="data" />
    </div>
</template>

<script setup lang="ts">
const data = {
    title: {
        main: 'VIRGO',
        sub: 'Analyze and Sincerity, Virgo',
    },
    body: `乙女座は、黄道十二星座の6番目に位置する星座であり、ラテン語で「Virgo（ヴァーゴ）」と呼ばれ、乙女を象徴しています。この星座は、古代の星座観測者によって穀物の収穫と農業に関連付けられ、豊穣と秩序を表すものとされています。
            乙女座の人々は、分析的で合理的な思考を持ち、詳細に注意を払う傾向があります。彼らは非常に忠実で責任感が強く、他人に対して思いやりがあります。また、健康や身体的な健全さにも関心を持つことが多いです。一方で、時には慎重すぎて自己評価が厳しいことがあるかもしれません。
            占星術的には、乙女座は秩序、労働、健康、細部への注意に焦点を当て、完璧主義や改善への欲求が強調されることがあります。乙女座は8月23日から9月22日までの期間に太陽が通過する星座であり、この期間に生まれた人々は乙女座の特徴を強調された個性を持つとされています。`,
};
</script>